$(function () {
    'use strict';



    var resourceList = [
        {
            song: '阳光彩虹小白马',
            singer: '大张伟',
            src: 'horse.mp3',
            lyric: `[ti:阳光彩虹小白马]
                   [ar:大张伟]
                   [al:阳光彩虹小白马]
                   [by:天龙888]
                   [00:00.00]大张伟 - 阳光彩虹小白马
                   [00:01.87]作词：大张伟
                   [00:02.73]作曲：大张伟
                   [00:15.64]怎么能哭呢 一切会好哒
                   [00:20.65]一切都去吧 你就得想着
                   [00:25.66]既然没办法 还恨他干嘛
                   [00:30.62]还管它干嘛 心里要记得
                   [00:36.25]你是内内个内内内个内个内内
                   [00:38.94]内内个内内内个内个内内
                   [00:41.57]阳光彩虹小白马滴滴哒滴滴哒
                   [00:46.28]我是内内个内内内个内个内内
                   [00:48.96]内内个内内内个内个内内
                   [00:51.43]阳光彩虹小白马滴滴哒滴滴哒
                   [00:56.54]滴滴哒滴哒滴滴哒滴哒
                   [00:58.96]滴滴哒滴滴哒
                   [01:01.61]滴滴哒滴哒滴滴哒滴哒
                   [01:03.94]滴滴哒滴滴哒嘿
                   [01:06.06]你是内内个内内内个内个内内
                   [01:09.00]内内个内内内个内个内个内
                   [01:11.63]内内个内内内个内个内内
                   [01:14.00]内内个内内内个内个内个内
                   [01:16.43]内内个内内内个内个内内
                   [01:18.91]内内个内内内个内个内个内
                   [01:21.44]内内个内内内个内个内内
                   [01:24.14]阳光彩虹小白马
                   [01:26.10]你是最强哒最棒哒
                   [01:27.67]最亮哒最发光哒
                   [01:29.04]拦不住你发芽
                   [01:31.07]你是最好哒最俏哒
                   [01:32.69]最妙哒最骄傲哒
                   [01:34.06]尽情的盛开吧
                   [01:35.72]你就是最强哒最棒哒
                   [01:37.75]最亮哒最发光哒
                   [01:39.12]心需要你哄它
                   [01:41.18]你是最好哒最俏哒
                   [01:42.75]最妙哒最骄傲哒
                   [01:44.01]阳光彩虹小白马
                   [01:50.64]生活是笑话 别哭着听它
                   [01:55.60]别在意梗垮 不乐是你傻
                   [02:00.60]心要你哄它 一切会好哒
                   [02:05.61]一切都来吧 天地随你耍
                   [02:11.18]你是内内个内内内个内个内内
                   [02:13.96]内内个内内内个内个内内
                   [02:16.43]阳光彩虹小白马滴滴哒滴滴哒
                   [02:21.03]我是内内个内内内个内个内内
                   [02:24.02]内内个内内内个内个内内
                   [02:26.46]阳光彩虹小白马滴滴哒滴滴哒
                   [02:31.51]滴滴哒滴哒滴滴哒滴哒
                   [02:33.84]滴滴哒滴滴哒
                   [02:36.37]滴滴哒滴哒滴滴哒滴哒
                   [02:38.90]滴滴哒滴滴哒嘿
                   [02:41.07]你是内内个内内内个内个内内
                   [02:43.95]内内个内内内个内个内个内
                   [02:46.48]内内个内内内个内个内内
                   [02:48.91]内内个内内内个内个内个内
                   [02:51.44]内内个内内内个内个内内
                   [02:53.91]内内个内内内个内个内个内
                   [02:56.40]内内个内内内个内个内内
                   [02:58.97]阳光彩虹小白马
                   [03:01.20]你是最强哒最棒哒
                   [03:02.71]最亮哒最发光哒
                   [03:04.08]拦不住你发芽
                   [03:06.10]你是最好哒最俏哒
                   [03:07.62]最妙哒最骄傲哒
                   [03:09.03]尽情的盛开吧
                   [03:10.70]你就是最强哒最棒哒
                   [03:12.72]最亮哒最发光哒
                   [03:13.98]心需要你哄它
                   [03:16.15]你是最好哒最俏哒
                   [03:17.72]最妙哒最骄傲哒
                   [03:19.03]阳光彩虹小白马
                   [03:21.05]你是最强哒最棒哒
                   [03:22.67]最亮哒最发光哒
                   [03:23.99]拦不住你发芽
                   [03:26.06]你是最好哒最俏哒
                   [03:27.63]最妙哒最骄傲哒
                   [03:29.00]尽情的盛开吧
                   [03:30.51]你就是最强哒最棒哒
                   [03:32.69]最亮哒最发光哒
                   [03:34.10]心需要你哄它
                   [03:36.08]你是最好哒最俏哒
                   [03:37.65]最妙哒最骄傲哒
                   [03:39.01]阳光彩虹小白马`
        },
        {
            song: 'ERO -2012 version-',
            singer: '山下智久',
            src: 'ero2012.mp3',
            lyric: `[ti:ERO -2012 version-]
                    [ar:山下智久]
                    [al:エロ]
                    [by:夹心饼干]
                    [00:00.27]ERO -2012 version-
                    [00:02.83]歌手：山下智久
                    [00:05.96]作詞：野島伸司
                    [00:08.40]作曲：前山田健一
                    [00:12.59]
                    [00:17.34]それ以上の問いかけには
                    [00:21.27]みんな答えられないわね
                    [00:25.40]赤い口　含み笑い
                    [00:29.09]ことさら謎めく淑女(あなた)
                    [00:32.84]
                    [00:33.53]それなのに　咽び泣く肌
                    [00:37.65]おびただしい汗の中
                    [00:41.72]泡立って呼吸しながらも
                    [00:46.09]TERATERA TOROTORO　溶けていくんだ
                    [00:49.40]
                    [00:50.22]抱きしめて　もっと　強く　何もかも忘れてしまいたいから
                    [00:58.45]狂おしく　キツく　ズルく　そんな私　壊して
                    [01:06.12]
                    [01:07.06]今夜だけ　もっと　強く　何度でも眩暈の中に埋もれて
                    [01:15.12]押し寄せて　高く　果てて　そんな私死なせて　SO HOT
                    [01:25.88]
                    [01:34.16]明日になればサヨウナラ
                    [01:38.23]真夏のカゲロウのようね
                    [01:42.60]青い瞳に　翳が差す
                    [01:46.17]ことさら謎めく淑女(あなた)
                    [01:49.79]
                    [01:50.67]抱きしめたい　もっと　強く　何もかも知らされないままなら
                    [01:58.96]何度でも　キツく　深く　そうさ朝が来るまで
                    [02:06.64]
                    [02:07.52]切ないよ　だって　もっと　あなたと解り合える筈なのに
                    [02:15.77]糸を引く　キスを　キスして　じゃあねお別れなんて　SO COOL
                    [02:26.13]
                    [02:41.34]恋なんて　使い捨てカイロのようね
                    [02:49.23]触れあう　熱が冷めれば
                    [02:53.11]微笑んで　バイバイ
                    [02:58.09]
                    [02:59.72]抱きしめて　もっと　強く　何もかも忘れてしまいたいから
                    [03:08.19]狂おしく　キツく　ズルく　そんな私　壊して
                    [03:16.04]
                    [03:16.92]今夜だけ　もっと　強く　何度でも眩暈の中に埋もれて
                    [03:24.86]押し寄せて　高く　果てて　そんな私死なせて　SO HOT
                    [03:39.84]`
        },
	{
            song: '月の幻',
            singer: '山下智久',
            src: 'moon.mp3',
            lyric: `[ti:月の幻]
                    [ar:山下智久]
                    [al:SUMMER NUDE ’13]
                    [by:Vine]
                    [00:00.67]「月の幻」
                    [00:04.67]作詞∶H.U.B.
                    [00:06.67]作曲∶Andrew Underberg/Marquis Wallace/Rico Davis
                    [00:08.67]歌∶山下智久
                    [00:10.67]
                    [00:12.67]もしも僕らがあの時に 出会わなければ君は今頃
                    [00:20.10]他の誰かとキスをして 抱き合うのだろう 瞳を閉じて
                    [00:26.68]全く違った道を歩いて すれ違っても気づかないまま
                    [00:33.04]他の誰かとキスをして 抱き合うんだよ だから今夜は
                    [00:38.87]
                    [00:39.52]目隠しして 首筋から たどってゆく カタチどおりに
                    [00:46.51]指先覚えてる感覚 月明かりに浮かんでる shadow
                    [00:53.13]oh why oh why 君なんていない 夜が作る幻みたい
                    [00:59.66]何度も繰り返し言い聞かす 僕は君を愛してなんていない
                    [01:10.97]
                    [01:13.04]自由を履き違えて 海の底に迷い込んだよ
                    [01:19.32]苦しくなって見上げたら 水槽の中 出口もなくて
                    [01:25.94]息ができない 空が見えない 光もない 手探りしてる
                    [01:32.40]君は愛を持て余す ガラスケース抱えたままで
                    [01:38.21]
                    [01:38.87]目隠しして 首筋から たどってゆく カタチどおりに
                    [01:45.63]指先覚えてる感覚 月明かりに浮かんでる shadow
                    [01:52.54]oh why oh why 君なんていない 夜が作る幻みたい
                    [01:58.77]何度も繰り返し言い聞かす 僕は君を愛してなんていない
                    [02:05.42]
                    [02:06.21]今 君の涙で溺れてしまう前に
                    [02:12.65]壊してしまうんだ 振り向かないで ここから
                    [02:17.69]あんなにも輝いて 忘れたいのに 悲しみは君だけじゃない
                    [02:24.68]もうこれ以上 そして今度は no not say anything 愛はもういない
                    [02:40.96]
                    [02:44.48]目隠しして 首筋から たどってゆく カタチどおりに
                    [02:51.45]指先覚えてる感覚 月明かりに浮かんでる shadow
                    [02:58.04]oh why oh why 君なんていない 夜が作る幻みたい
                    [03:04.63]何度も繰り返し言い聞かす 僕は君を愛してなんていない
                    [03:27.02]
                    [03:40.02]Lrc By VINE (C) www.90lrc.cn
                    [03:45.02]終わり
                    [03:59.02]`
        },
        {
            song: 'Les Rois Du Monde世界之王',
            singer: 'Gérard Presgurvic',
            src: 'monde.mp3',
            lyric: ""
        },
    ]
    
     new Player(resourceList);
})